app/controllers/costumes_controller.rb

  def index
    @costumes = Costume.all
---
SELECT "costumes".* FROM "costumes"

  def create
    @costume = Costume.new(costume_params)

    if @costume.save
---
INSERT INTO "costumes" ("img", "name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    if @costume.update(costume_params)
---
UPDATE "costumes" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "costumes"."id" = $4  [["name", "yod"], ["description", "yod"], ["updated_at", "2020-01-16 20:22:22.671665"], ["id", 22]]

  def destroy
    @costume.destroy
---
DELETE FROM "costumes" WHERE "costumes"."id" = $1  [["id", 1]]

    def set_costume
      @costume = Costume.find(params[:id])
---
SELECT "costumes".* FROM "costumes" WHERE "costumes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]