app/controllers/items_controller.rb

  def create
    puts 'params', params
    @costume = Costume.find(params[:costume_id])
    # @item = Item.new(item_params)
    @item = @costume.items.create(item_params)
---
SELECT "costumes".* FROM "costumes" WHERE "costumes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "items" ("img", "name", "description", "created_at", "updated_at", "costume_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["img", "j"], ["name", "j"], ["description", "j"], ["created_at", "2020-01-16 01:06:47.069336"], ["updated_at", "2020-01-16 01:06:47.069336"], ["costume_id", 2]]